espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_struct.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: lcd configuration registers */
/** Type of lcd_clock register
 *  LCD clock config register.
 */
typedef union {
    struct {
        /** lcd_clkcnt_n : R/W; bitpos: [5:0]; default: 3;
         *  f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1) when reg_clk_equ_sysclk is 0.
         */
        uint32_t lcd_clkcnt_n:6;
        /** lcd_clk_equ_sysclk : R/W; bitpos: [6]; default: 1;
         *  1: f_LCD_PCLK = f_LCD_CLK. 0: f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1).
         */
        uint32_t lcd_clk_equ_sysclk:1;
        /** lcd_ck_idle_edge : R/W; bitpos: [7]; default: 0;
         *  1: LCD_PCLK line is high when idle     0: LCD_PCLK line is low when idle.
         */
        uint32_t lcd_ck_idle_edge:1;
        /** lcd_ck_out_edge : R/W; bitpos: [8]; default: 0;
         *  1: LCD_PCLK line is high in the first half data cycle.     0: LCD_PCLK line is low
         *  in the second half data cycle.
         */
        uint32_t lcd_ck_out_edge:1;
        /** lcd_clkm_div_num : R/W; bitpos: [16:9]; default: 4;
         *  Integral LCD clock divider value
         */
        uint32_t lcd_clkm_div_num:8;
        /** lcd_clkm_div_b : R/W; bitpos: [22:17]; default: 0;
         *  Fractional clock divider numerator value
         */
        uint32_t lcd_clkm_div_b:6;
        /** lcd_clkm_div_a : R/W; bitpos: [28:23]; default: 0;
         *  Fractional clock divider denominator value
         */
        uint32_t lcd_clkm_div_a:6;
        /** lcd_clk_sel : R/W; bitpos: [30:29]; default: 0;
         *  Select LCD module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.
         */
        uint32_t lcd_clk_sel:2;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  Set this bit to enable clk gate
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} lcdcam_lcd_clock_reg_t;

/** Type of lcd_rgb_yuv register
 *  LCD YUV/RGB converter configuration register.
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** lcd_conv_hor_pixel_num : R/W; bitpos: [15:5]; default: 0;
         *  the horizontal pixel number when rgb trans to yuv420
         */
        uint32_t lcd_conv_hor_pixel_num:11;
        /** lcd_conv_mem_clk_en : R/W; bitpos: [16]; default: 0;
         *  0:Open the clock gate for lcd convert memory.1: Close the clock gate for lcd
         *  convert memory
         */
        uint32_t lcd_conv_mem_clk_en:1;
        /** lcd_conv_8bits_data_inv : R/W; bitpos: [17]; default: 0;
         *  1:invert every two 8bits input data. 2. disabled.
         */
        uint32_t lcd_conv_8bits_data_inv:1;
        /** lcd_conv_txtorx : R/W; bitpos: [18]; default: 0;
         *  0: txtorx mode off. 1: txtorx mode on.
         */
        uint32_t lcd_conv_txtorx:1;
        /** lcd_conv_rgb_mode : R/W; bitpos: [19]; default: 0;
         *  0:rgb565.1:rgb888.Determine the rgb format yuv420 trans to.
         */
        uint32_t lcd_conv_rgb_mode:1;
        /** lcd_conv_rgb2rgb_mode : R/W; bitpos: [21:20]; default: 2;
         *  0: to rgb565. 1: to rgb888. Others: disabled.To enable rgb2rgb mode, trans_mode
         *  must be set to 0.
         */
        uint32_t lcd_conv_rgb2rgb_mode:2;
        /** lcd_conv_yuv2yuv_mode : R/W; bitpos: [23:22]; default: 3;
         *  0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode,
         *  trans_mode must be set to 1.
         */
        uint32_t lcd_conv_yuv2yuv_mode:2;
        /** lcd_conv_yuv_mode : R/W; bitpos: [25:24]; default: 0;
         *  0: yuv422. 1: yuv420. 2: yuv411. When in yuv2yuv mode, yuv_mode decides the yuv
         *  mode of Data_in
         */
        uint32_t lcd_conv_yuv_mode:2;
        /** lcd_conv_protocol_mode : R/W; bitpos: [26]; default: 0;
         *  0:BT601. 1:BT709.
         */
        uint32_t lcd_conv_protocol_mode:1;
        /** lcd_conv_data_out_mode : R/W; bitpos: [27]; default: 0;
         *  LIMIT or FULL mode of Data out. 0: limit. 1: full
         */
        uint32_t lcd_conv_data_out_mode:1;
        /** lcd_conv_data_in_mode : R/W; bitpos: [28]; default: 0;
         *  LIMIT or FULL mode of Data in. 0: limit. 1: full
         */
        uint32_t lcd_conv_data_in_mode:1;
        /** lcd_conv_mode_8bits_on : R/W; bitpos: [29]; default: 0;
         *  0: 16bits mode. 1: 8bits mode.
         */
        uint32_t lcd_conv_mode_8bits_on:1;
        /** lcd_conv_trans_mode : R/W; bitpos: [30]; default: 0;
         *  0: YUV to RGB. 1: RGB to YUV.
         */
        uint32_t lcd_conv_trans_mode:1;
        /** lcd_conv_enable : R/W; bitpos: [31]; default: 0;
         *  0: Bypass converter. 1: Enable converter.
         */
        uint32_t lcd_conv_enable:1;
    };
    uint32_t val;
} lcdcam_lcd_rgb_yuv_reg_t;

/** Type of lcd_user register
 *  LCD config register.
 */
typedef union {
    struct {
        /** lcd_dout_cyclelen : R/W; bitpos: [12:0]; default: 1;
         *  The output data cycles minus 1 of LCD module.
         */
        uint32_t lcd_dout_cyclelen:13;
        /** lcd_always_out_en : R/W; bitpos: [13]; default: 0;
         *  LCD always output when LCD is in LCD_DOUT state, unless reg_lcd_start is cleared or
         *  reg_lcd_reset is set.
         */
        uint32_t lcd_always_out_en:1;
        /** lcd_dout_byte_swizzle_mode : R/W; bitpos: [16:14]; default: 0;
         *  0: ABAB->BABA. 1: ABC->ACB. 2: ABC->BAC. 3: ABC->BCA. 4:ABC->CAB. 5:ABC->CBA
         */
        uint32_t lcd_dout_byte_swizzle_mode:3;
        /** lcd_dout_byte_swizzle_enable : R/W; bitpos: [17]; default: 0;
         *  1: enable byte swizzle 0: disable
         */
        uint32_t lcd_dout_byte_swizzle_enable:1;
        /** lcd_dout_bit_order : R/W; bitpos: [18]; default: 0;
         *  1: change bit order in every byte. 0: Not change.
         */
        uint32_t lcd_dout_bit_order:1;
        /** lcd_byte_mode : R/W; bitpos: [20:19]; default: 0;
         *  2: 24bit mode. 1: 16bit mode. 0: 8bit mode
         */
        uint32_t lcd_byte_mode:2;
        /** lcd_update_reg : R/W/SC; bitpos: [21]; default: 0;
         *  1: Update LCD registers, will be cleared by hardware. 0 : Not care.
         */
        uint32_t lcd_update_reg:1;
        /** lcd_bit_order : R/W; bitpos: [22]; default: 0;
         *  1: Change data bit order, change LCD_DATA_out[7:0] to LCD_DATA_out[0:7] in one byte
         *  mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not change.
         */
        uint32_t lcd_bit_order:1;
        /** lcd_byte_order : R/W; bitpos: [23]; default: 0;
         *  1: invert data byte order, only valid in 2 byte mode. 0: Not change.
         */
        uint32_t lcd_byte_order:1;
        /** lcd_dout : R/W; bitpos: [24]; default: 0;
         *  1: Be able to send data out in LCD sequence when LCD starts. 0: Disable.
         */
        uint32_t lcd_dout:1;
        /** lcd_dummy : R/W; bitpos: [25]; default: 0;
         *  1: Enable DUMMY phase in LCD sequence when LCD starts. 0: Disable.
         */
        uint32_t lcd_dummy:1;
        /** lcd_cmd : R/W; bitpos: [26]; default: 0;
         *  1: Be able to send command in LCD sequence when LCD starts. 0: Disable.
         */
        uint32_t lcd_cmd:1;
        /** lcd_start : R/W/SC; bitpos: [27]; default: 0;
         *  LCD start sending data enable signal, valid in high level.
         */
        uint32_t lcd_start:1;
        /** lcd_reset : WT; bitpos: [28]; default: 0;
         *  The value of  command.
         */
        uint32_t lcd_reset:1;
        /** lcd_dummy_cyclelen : R/W; bitpos: [30:29]; default: 0;
         *  The dummy cycle length minus 1.
         */
        uint32_t lcd_dummy_cyclelen:2;
        /** lcd_cmd_2_cycle_en : R/W; bitpos: [31]; default: 0;
         *  The cycle length of command phase. 1: 2 cycles. 0: 1 cycle.
         */
        uint32_t lcd_cmd_2_cycle_en:1;
    };
    uint32_t val;
} lcdcam_lcd_user_reg_t;

