espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_struct.h
/** Type of lcd_dly_mode_cfg2 register
 *  LCD config register.
 */
typedef union {
    struct {
        /** dout0_mode : R/W; bitpos: [1:0]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout0_mode:2;
        /** dout1_mode : R/W; bitpos: [3:2]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout1_mode:2;
        /** dout2_mode : R/W; bitpos: [5:4]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout2_mode:2;
        /** dout3_mode : R/W; bitpos: [7:6]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout3_mode:2;
        /** dout4_mode : R/W; bitpos: [9:8]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout4_mode:2;
        /** dout5_mode : R/W; bitpos: [11:10]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout5_mode:2;
        /** dout6_mode : R/W; bitpos: [13:12]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout6_mode:2;
        /** dout7_mode : R/W; bitpos: [15:14]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout7_mode:2;
        /** dout8_mode : R/W; bitpos: [17:16]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout8_mode:2;
        /** dout9_mode : R/W; bitpos: [19:18]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout9_mode:2;
        /** dout10_mode : R/W; bitpos: [21:20]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout10_mode:2;
        /** dout11_mode : R/W; bitpos: [23:22]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout11_mode:2;
        /** dout12_mode : R/W; bitpos: [25:24]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout12_mode:2;
        /** dout13_mode : R/W; bitpos: [27:26]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout13_mode:2;
        /** dout14_mode : R/W; bitpos: [29:28]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout14_mode:2;
        /** dout15_mode : R/W; bitpos: [31:30]; default: 0;
         *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
         *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
         *  LCD_CLK.
         */
        uint32_t dout15_mode:2;
    };
    uint32_t val;
} lcdcam_lcd_dly_mode_cfg2_reg_t;

/** Type of lcd_trans_buff_cfg register
 *  LCD trans buffer register
 */
typedef union {
    struct {
        /** lcd_trans_buffer_ena : R/W; bitpos: [0]; default: 0;
         *  1:enable lcd trans buffer.0:not enable lcd trans buffer
         */
        uint32_t lcd_trans_buffer_ena:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lcdcam_lcd_trans_buff_cfg_reg_t;


/** Group: cam configuration registers */
/** Type of cam_ctrl register
 *  CAM config register.
 */
typedef union {
    struct {
        /** cam_stop_en : R/W; bitpos: [0]; default: 0;
         *  Camera stop enable signal, 1: camera stops when DMA Rx FIFO is full. 0: Not stop.
         */
        uint32_t cam_stop_en:1;
        /** cam_vsync_filter_thres : R/W; bitpos: [3:1]; default: 0;
         *  Filter threshold value for CAM_VSYNC signal.
         */
        uint32_t cam_vsync_filter_thres:3;
        /** cam_update_reg : R/W/SC; bitpos: [4]; default: 0;
         *  1: Update Camera registers, will be cleared by hardware. 0 : Not care.
         */
        uint32_t cam_update_reg:1;
        /** cam_byte_order : R/W; bitpos: [5]; default: 0;
         *  1: invert data byte order. 0: Not change.
         */
        uint32_t cam_byte_order:1;
        /** cam_bit_order : R/W; bitpos: [6]; default: 0;
         *  1: Change data bit order, change CAM_DATA_in[7:0] to CAM_DATA_in[0:7] in one byte
         *  mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not change.
         */
        uint32_t cam_bit_order:1;
        /** cam_line_int_en : R/W; bitpos: [7]; default: 0;
         *  1: Enable to generate CAM_HS_INT. 0: Disable.
         */
        uint32_t cam_line_int_en:1;
        /** cam_vs_eof_en : R/W; bitpos: [8]; default: 0;
         *  1: CAM_VSYNC to generate in_suc_eof. 0: in_suc_eof is controlled by
         *  reg_cam_rec_data_cyclelen.
         */
        uint32_t cam_vs_eof_en:1;
        /** cam_clkm_div_num : R/W; bitpos: [16:9]; default: 4;
         *  Integral Camera clock divider value
         */
        uint32_t cam_clkm_div_num:8;
        /** cam_clkm_div_b : R/W; bitpos: [22:17]; default: 0;
         *  Fractional clock divider numerator value
         */
        uint32_t cam_clkm_div_b:6;
        /** cam_clkm_div_a : R/W; bitpos: [28:23]; default: 0;
         *  Fractional clock divider denominator value
         */
        uint32_t cam_clkm_div_a:6;
        /** cam_clk_sel : R/W; bitpos: [30:29]; default: 0;
         *  Select Camera module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.
         */
        uint32_t cam_clk_sel:2;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lcdcam_cam_ctrl_reg_t;

/** Type of cam_ctrl1 register
 *  CAM config register.
 */
typedef union {
    struct {
        /** cam_rec_data_bytelen : R/W; bitpos: [15:0]; default: 0;
         *  Camera receive data byte length minus 1 to set DMA in_suc_eof_int.
         */
        uint32_t cam_rec_data_bytelen:16;
        /** cam_line_int_num : R/W; bitpos: [21:16]; default: 0;
         *  The line number minus 1 to generate cam_hs_int.
         */
        uint32_t cam_line_int_num:6;
        /** cam_clk_inv : R/W; bitpos: [22]; default: 0;
         *  1: Invert  the input signal CAM_PCLK. 0: Not invert.
         */
        uint32_t cam_clk_inv:1;
        /** cam_vsync_filter_en : R/W; bitpos: [23]; default: 0;
         *  1: Enable CAM_VSYNC filter function. 0: bypass.
         */
        uint32_t cam_vsync_filter_en:1;
        /** cam_2byte_en : R/W; bitpos: [24]; default: 0;
         *  1: The bit number of input data is 9~16.  0: The bit number of input data is 0~8.
         */
        uint32_t cam_2byte_en:1;
        /** cam_de_inv : R/W; bitpos: [25]; default: 0;
         *  CAM_DE invert enable signal, valid in high level.
         */
        uint32_t cam_de_inv:1;
        /** cam_hsync_inv : R/W; bitpos: [26]; default: 0;
         *  CAM_HSYNC invert enable signal, valid in high level.
         */
        uint32_t cam_hsync_inv:1;
        /** cam_vsync_inv : R/W; bitpos: [27]; default: 0;
         *  CAM_VSYNC invert enable signal, valid in high level.
         */
        uint32_t cam_vsync_inv:1;
        /** cam_vh_de_mode_en : R/W; bitpos: [28]; default: 0;
         *  1: Input control signals are CAM_DE CAM_HSYNC and CAM_VSYNC. 0: Input control
         *  signals are CAM_DE and CAM_VSYNC.
         */
        uint32_t cam_vh_de_mode_en:1;
        /** cam_start : R/W/SC; bitpos: [29]; default: 0;
         *  Camera module start signal.
         */
        uint32_t cam_start:1;
        /** cam_reset : WT; bitpos: [30]; default: 0;
         *  Camera module reset signal.
         */
        uint32_t cam_reset:1;
        /** cam_afifo_reset : WT; bitpos: [31]; default: 0;
         *  Camera AFIFO reset signal.
         */
        uint32_t cam_afifo_reset:1;
    };
    uint32_t val;
} lcdcam_cam_ctrl1_reg_t;

