espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_struct.h
/** Type of cam_rgb_yuv register
 *  CAM YUV/RGB converter configuration register.
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** cam_conv_hor_pixel_num : R/W; bitpos: [20:10]; default: 0;
         *  the horizontal pixel number when rgb trans to yuv420
         */
        uint32_t cam_conv_hor_pixel_num:11;
        /** cam_conv_8bits_data_inv : R/W; bitpos: [21]; default: 0;
         *  1:invert every two 8bits input data. 2. disabled.
         */
        uint32_t cam_conv_8bits_data_inv:1;
        /** cam_conv_yuv2yuv_mode : R/W; bitpos: [23:22]; default: 3;
         *  0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode,
         *  trans_mode must be set to 1.
         */
        uint32_t cam_conv_yuv2yuv_mode:2;
        /** cam_conv_yuv_mode : R/W; bitpos: [25:24]; default: 0;
         *  0: yuv422. 1: yuv420. 2: yuv411.The format that Data_in should be converted to.
         */
        uint32_t cam_conv_yuv_mode:2;
        /** cam_conv_protocol_mode : R/W; bitpos: [26]; default: 0;
         *  0:BT601. 1:BT709.
         */
        uint32_t cam_conv_protocol_mode:1;
        /** cam_conv_data_out_mode : R/W; bitpos: [27]; default: 0;
         *  LIMIT or FULL mode of Data out. 0: limit. 1: full
         */
        uint32_t cam_conv_data_out_mode:1;
        /** cam_conv_data_in_mode : R/W; bitpos: [28]; default: 0;
         *  LIMIT or FULL mode of Data in. 0: limit. 1: full
         */
        uint32_t cam_conv_data_in_mode:1;
        /** cam_conv_mode_8bits_on : R/W; bitpos: [29]; default: 0;
         *  0: 16bits mode. 1: 8bits mode.
         */
        uint32_t cam_conv_mode_8bits_on:1;
        /** cam_conv_trans_mode : R/W; bitpos: [30]; default: 0;
         *  0: YUV to RGB. 1: RGB to YUV.
         */
        uint32_t cam_conv_trans_mode:1;
        /** cam_conv_enable : R/W; bitpos: [31]; default: 0;
         *  0: Bypass converter. 1: Enable converter.
         */
        uint32_t cam_conv_enable:1;
    };
    uint32_t val;
} lcdcam_cam_rgb_yuv_reg_t;


/** Group: lcd status registers */
/** Type of lcd_data_dbg register
 *  LCDCAM LCD debug data register
 */
typedef union {
    struct {
        /** lcd_dbg_data_relpace_ena : R/W; bitpos: [0]; default: 0;
         *  1:replace the data read from dma.0:not replace the data read from dma
         */
        uint32_t lcd_dbg_data_relpace_ena:1;
        /** lcd_dbg_data : R/W; bitpos: [24:1]; default: 0;
         *  the debug data that used to replace data read from dma
         */
        uint32_t lcd_dbg_data:24;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} lcdcam_lcd_data_dbg_reg_t;

/** Type of lcd_bw_monitor_dbg register
 *  LCDCAM LCD monitor bandwidth debug register
 */
typedef union {
    struct {
        /** lcd_bw_monitore_ena : R/W; bitpos: [0]; default: 0;
         *  1:enable lcd monitor bandwidth.0: not enable lcd monitor bandwidth
         */
        uint32_t lcd_bw_monitore_ena:1;
        /** lcd_invalid_rd_number : RO; bitpos: [31:1]; default: 0;
         *  the statistical data that lcd rd invalid data
         */
        uint32_t lcd_invalid_rd_number:31;
    };
    uint32_t val;
} lcdcam_lcd_bw_monitor_dbg_reg_t;


/** Group: cam status registers */
/** Type of cam_data_dbg register
 *  LCDCAM CAM debug data register
 */
typedef union {
    struct {
        /** cam_dbg_data_relpace_ena : R/W; bitpos: [0]; default: 0;
         *  1:replace the data write to dma.0:not replace the data write to  dma
         */
        uint32_t cam_dbg_data_relpace_ena:1;
        /** cam_dbg_data : R/W; bitpos: [24:1]; default: 0;
         *  the debug data that used to replace data write to dma
         */
        uint32_t cam_dbg_data:24;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} lcdcam_cam_data_dbg_reg_t;


/** Group: Interrupt registers */
/** Type of lc_dma_int_ena register
 *  LCDCAM interrupt enable register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_ena : R/W; bitpos: [0]; default: 0;
         *  The enable bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_ena:1;
        /** lcd_trans_done_int_ena : R/W; bitpos: [1]; default: 0;
         *  The enable bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_ena:1;
        /** cam_vsync_int_ena : R/W; bitpos: [2]; default: 0;
         *  The enable bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_ena:1;
        /** cam_hs_int_ena : R/W; bitpos: [3]; default: 0;
         *  The enable bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_ena:1;
        /** lcd_underrun_int_ena : R/W; bitpos: [4]; default: 0;
         *  The enable bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_ena:1;
        /** cam_overflow_int_ena : R/W; bitpos: [5]; default: 0;
         *  The enable bit for Camera overflow interrupt
         */
        uint32_t cam_overflow_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lcdcam_lc_dma_int_ena_reg_t;

/** Type of lc_dma_int_raw register
 *  LCDCAM interrupt raw register, valid in level.
 */
typedef union {
    struct {
        /** lcd_vsync_int_raw : RO/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_raw:1;
        /** lcd_trans_done_int_raw : RO/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_raw:1;
        /** cam_vsync_int_raw : RO/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_raw:1;
        /** cam_hs_int_raw : RO/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_raw:1;
        /** lcd_underrun_int_raw : RO/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_raw:1;
        /** cam_overflow_int_raw : RO/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit for Camera overflow interrupt
         */
        uint32_t cam_overflow_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lcdcam_lc_dma_int_raw_reg_t;

/** Type of lc_dma_int_st register
 *  LCDCAM interrupt status register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_st : RO; bitpos: [0]; default: 0;
         *  The status bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_st:1;
        /** lcd_trans_done_int_st : RO; bitpos: [1]; default: 0;
         *  The status bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_st:1;
        /** cam_vsync_int_st : RO; bitpos: [2]; default: 0;
         *  The status bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_st:1;
        /** cam_hs_int_st : RO; bitpos: [3]; default: 0;
         *  The status bit for Camera transfer end interrupt.
         */
        uint32_t cam_hs_int_st:1;
        /** lcd_underrun_int_st : RO; bitpos: [4]; default: 0;
         *  The status bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_st:1;
        /** cam_overflow_int_st : RO; bitpos: [5]; default: 0;
         *  The status bit for Camera overflow interrupt
         */
        uint32_t cam_overflow_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lcdcam_lc_dma_int_st_reg_t;

/** Type of lc_dma_int_clr register
 *  LCDCAM interrupt clear register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_clr : WT; bitpos: [0]; default: 0;
         *  The clear bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_clr:1;
        /** lcd_trans_done_int_clr : WT; bitpos: [1]; default: 0;
         *  The clear bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_clr:1;
        /** cam_vsync_int_clr : WT; bitpos: [2]; default: 0;
         *  The clear bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_clr:1;
        /** cam_hs_int_clr : WT; bitpos: [3]; default: 0;
         *  The clear bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_clr:1;
        /** lcd_underrun_int_clr : WT; bitpos: [4]; default: 0;
         *  The clear bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_clr:1;
        /** cam_overflow_int_clr : WT; bitpos: [5]; default: 0;
         *  The clear bit for Camera overflow interrupt
         */
        uint32_t cam_overflow_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lcdcam_lc_dma_int_clr_reg_t;


/** Group: Version register */
/** Type of lc_reg_date register
 *  Version register
 */
typedef union {
    struct {
        /** lc_date : R/W; bitpos: [27:0]; default: 38814224;
         *  LCD_CAM version control register
         */
        uint32_t lc_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lcdcam_lc_reg_date_reg_t;


typedef struct lcd_cam_dev_t {
    volatile lcdcam_lcd_clock_reg_t lcd_clock;
    volatile lcdcam_cam_ctrl_reg_t cam_ctrl;
    volatile lcdcam_cam_ctrl1_reg_t cam_ctrl1;
    volatile lcdcam_cam_rgb_yuv_reg_t cam_rgb_yuv;
    volatile lcdcam_lcd_rgb_yuv_reg_t lcd_rgb_yuv;
    volatile lcdcam_lcd_user_reg_t lcd_user;
    volatile lcdcam_lcd_misc_reg_t lcd_misc;
    volatile lcdcam_lcd_rgb_vertical_reg_t lcd_rgb_vertical;
    volatile lcdcam_lcd_rgb_horizontal_reg_t lcd_rgb_horizontal;
    volatile lcdcam_lcd_rgb_blank_reg_t lcd_rgb_blank;
    volatile lcdcam_lcd_rgb_ctrl_reg_t lcd_rgb_ctrl;
    volatile lcdcam_lcd_first_cmd_val_reg_t lcd_first_cmd_val;
    volatile lcdcam_lcd_latter_cmd_val_reg_t lcd_latter_cmd_val;
    volatile lcdcam_lcd_dly_mode_cfg1_reg_t lcd_dly_mode_cfg1;
    volatile lcdcam_lcd_dly_mode_cfg2_reg_t lcd_dly_mode_cfg2;
    volatile lcdcam_lcd_trans_buff_cfg_reg_t lcd_trans_buff_cfg;
    volatile lcdcam_lcd_data_dbg_reg_t lcd_data_dbg;
    volatile lcdcam_lcd_bw_monitor_dbg_reg_t lcd_bw_monitor_dbg;
    volatile lcdcam_cam_data_dbg_reg_t cam_data_dbg;
    uint32_t reserved_04c[6];
    volatile lcdcam_lc_dma_int_ena_reg_t lc_dma_int_ena;
    volatile lcdcam_lc_dma_int_raw_reg_t lc_dma_int_raw;
    volatile lcdcam_lc_dma_int_st_reg_t lc_dma_int_st;
    volatile lcdcam_lc_dma_int_clr_reg_t lc_dma_int_clr;
    uint32_t reserved_074[34];
    volatile lcdcam_lc_reg_date_reg_t lc_reg_date;
} lcd_cam_dev_t;

extern lcd_cam_dev_t LCD_CAM;

#ifndef __cplusplus
_Static_assert(sizeof(lcd_cam_dev_t) == 0x100, "Invalid size of lcdcam_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
